MegaC-C/MSP430/capture3.c
#include <msp430.h>

#define minTime 1600  	// 50ms @ ACLK; 1 = 31,25ms
#define maxTime 1

unsigned int lastTime, capturedTime, deltaTime;
int pressButton = 2;

int main(void)
{
    WDTCTL = WDTPW | WDTHOLD; // stop watchdog timer

    P2DIR |= BIT0 | BIT5 | BIT1; //Set LED rgb as output
    P1DIR &= ~BIT1;     // set as input

    // ---setup Timer---  as described in MSP430 workshop series
    // 1.configure Timer
    TA1CTL |= TACLR;        // clear TA1
    TA1CTL |= TASSEL_1 | TAIE;  // ACLK as source, enable TA1IFG interrupt
    // 2.configure CCRx
    TA1CCTL1 |= CAP | CCIS_2 | CM_3; // CCR1 in capture mode, select GND as initial input signal, sensitive to switching to VCC and GND
    // 3.clear IFG and start timer
    TA1CTL &= ~TAIFG;
    TA1CTL |= MC_1;

    __enable_interrupt();   // enable global interrupts

    while (1)
    {
        if (pressButton == 0 && (P1IN & BIT1))
        {
            P2OUT = BIT0;   // red on
        }
        else
        {
            P2OUT &= ~BIT0;   // red off
        }
    }
    return 0;
}

#pragma vector = PORT1_VECTOR
__interrupt void myISR_Port1(void)
{
    TA1CCTL1 ^= CCIS0;      // toggle VCC and GND to capture TA1.1
    lastTime = capturedTime;
    capturedTime = TA1CCR1;
    deltaTime = capturedTime - lastTime;
    if (minTime < deltaTime && pressButton != 0)
    {
        if (deltaTime < maxTime)
        {
            --pressButton;
        }
        else
        {
            pressButton = 2;
        }
    }
    P1IFG &= ~BIT1;
}

#pragma vector = TIMER1_A1_VECTOR
__interrupt void myISR_TA1_other(void)
{
    if(pressButton == 0)
    {

    }
    TA1CTL &= TAIFG;
}
